In [1]:
#import necessary libraries
import pandas as pd
import mysql.connector
import numpy as np
%load_ext sql

In [2]:
#establishing a connection to mysql database
conn = mysql.connector.connect (
    host = 'localhost',
    user = 'root',
    password = 'KKkk#7',
)

In [3]:
%sql mysql://root:KKkk#7@localhost

# Database Creation and Table Setup

1.1 Create a database named edu_institute.

1.2 Within edu_institute, create a table named students with the following
structure:

In [4]:
%%sql
CREATE DATABASE edu_institute;
USE edu_institute;

CREATE TABLE students(
student_id INT PRIMARY KEY,
name VARCHAR(50),
age INT,
gender CHAR(1),
enrollment_date DATE,
program VARCHAR(50)
);

 * mysql://root:***@localhost
1 rows affected.
0 rows affected.
0 rows affected.

[]

# 2.Data Insertion

In [5]:
cursor = conn.cursor()

In [6]:
%sql mysql://root:KKkk#7@localhost/edu_institute

2.1 Insert at least 5 records into the students table, with diverse names, ages,
genders, enrolment dates, and programs. Ensure at least one student is enrolled in
"Data Science"

In [7]:
#sql command to insert records into the students table
sql = """
INSERT INTO students (student_id, name, age, gender, enrollment_date, program)
VALUES (%s, %s, %s, %s, %s, %s)
"""

students_data = [
    (11, 'Jeremy Martin', 25, 'M', '2023-04-30', 'Mechatronics'),
    (12, 'Christian Jane', 34, 'F', '2022-04-26', 'Data Science'),
    (13, 'August Leon', 27, 'M', '2024-01-01', 'Graphic Design'),
    (14, 'Amelda Qui', 19, 'F', '2023-10-09', 'Software Development'),
    (16, 'Karmelo Jonah', 42, 'M', '2021-03-04', 'UI/UX Design')
]

In [8]:
#select the database
cursor.execute("USE edu_institute;")

#Execute query with the students_data variable as an argument
cursor.executemany(sql, students_data)

#commit the changes and close the cursor and connection
conn.commit()
cursor.close()
conn.close()
print("Database, table, and records have been created successfully.")

Database, table, and records have been created successfully.

# 3. Basic Queries

3.1 Write a query to select all columns for all students in the "Data Science"
program

In [9]:
%%sql
SELECT * FROM students WHERE  program = 'Data Science';

   mysql://root:***@localhost
 * mysql://root:***@localhost/edu_institute
1 rows affected.

[(12, 'Christian Jane', 34, 'F', datetime.date(2022, 4, 26), 'Data Science')]

3.2 Write a query to find the total number of students and display it as Total
Students.

In [10]:
%%sql
SELECT COUNT(*) AS "Total Students" FROM students;

   mysql://root:***@localhost
 * mysql://root:***@localhost/edu_institute
1 rows affected.

[(5,)]

# 4. Function Usage

4.1 Use an appropriate function to display the current date in a column named
Today's Date.

In [11]:
%%sql
SELECT CURDATE() AS "Today's Date";

   mysql://root:***@localhost
 * mysql://root:***@localhost/edu_institute
1 rows affected.

[(datetime.date(2024, 3, 12),)]

4.2 Write a query to select the student names and their enrolment dates, but
display the name column in uppercase.

In [12]:
%%sql
SELECT UPPER(name) AS Name, enrollment_date FROM students;

   mysql://root:***@localhost
 * mysql://root:***@localhost/edu_institute
5 rows affected.

[('JEREMY MARTIN', datetime.date(2023, 4, 30)),
 ('CHRISTIAN JANE', datetime.date(2022, 4, 26)),
 ('AUGUST LEON', datetime.date(2024, 1, 1)),
 ('AMELDA QUI', datetime.date(2023, 10, 9)),
 ('KARMELO JONAH', datetime.date(2021, 3, 4))]

# 5. Advanced Queries

5.1 Write a query to count the number of students in each program and display the
results in descending order of count. Name the count column as Number of
Students.

In [13]:
%%sql
SELECT program, COUNT(*) AS "Number of Students"
FROM students
GROUP BY program
ORDER BY COUNT(*) DESC;

   mysql://root:***@localhost
 * mysql://root:***@localhost/edu_institute
5 rows affected.

[('Mechatronics', 1),
 ('Data Science', 1),
 ('Graphic Design', 1),
 ('Software Development', 1),
 ('UI/UX Design', 1)]

5.2 Write a query to find the youngest student's name and age

In [14]:
%%sql
SELECT name, age
FROM students
ORDER BY age ASC
LIMIT 1;

   mysql://root:***@localhost
 * mysql://root:***@localhost/edu_institute
1 rows affected.

[('Amelda Qui', 19)]